app/Controllers/Dosen.php

SELECT *
FROM `dosen`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `dosen`
---
    public function list()
    {
        $data = [
            'data'  => $this->dosen->paginate('2', 'dosen'),
            'title' => 'List Dosen',
            'pager' => $this->dosen->pager,
        ];

INSERT INTO `dosen` (`nama_dosen`, `matkul_dosen`, `alamat_dosen`) VALUES ('warni', 'analisa', 'tigaraksa')
---
    public function simpan()
    {
        $data = $this->request->getPost();

        if (! $this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->dosen->save($data);